
## Plan Result (terraform/env)

[CI link](https://github.com/team-all-in/all-in/actions/runs/10973383331)


<pre><code>Plan: 0 to add, 7 to change, 0 to destroy.</code></pre>

* Update
  * aws_apprunner_service.all_in_api_slack
  * aws_ecr_repository.all_in_api
  * aws_ecr_repository.all_in_api_discord
  * aws_ecr_repository.all_in_api_slack
  * aws_iam_policy.access
  * aws_iam_policy.discord_access
  * aws_iam_policy.slack_access


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:DescribeImages",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + resources = [
              + "arn:aws:ecr:ap-northeast-1:451153100141:repository/all_in_api",
            ]
          + sid       = "ReadPrivateEcr"
        }
      + statement {
          + actions   = [
              + "ecr:DescribeImages",
              + "ecr:GetAuthorizationToken",
              + "ssm:DescribeParameters",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AuthPrivateEcr"
        }
    }

  # data.aws_iam_policy_document.discord_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "discord_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:DescribeImages",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + resources = [
              + "arn:aws:ecr:ap-northeast-1:451153100141:repository/all_in_api_discord",
            ]
          + sid       = "ReadPrivateEcr"
        }
      + statement {
          + actions   = [
              + "ecr:DescribeImages",
              + "ecr:GetAuthorizationToken",
              + "ssm:DescribeParameters",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AuthPrivateEcr"
        }
    }

  # data.aws_iam_policy_document.slack_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "slack_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:DescribeImages",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + resources = [
              + "arn:aws:ecr:ap-northeast-1:451153100141:repository/all_in_api_slack",
            ]
          + sid       = "ReadPrivateEcr"
        }
      + statement {
          + actions   = [
              + "ecr:DescribeImages",
              + "ecr:GetAuthorizationToken",
              + "ssm:DescribeParameters",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AuthPrivateEcr"
        }
    }

  # aws_apprunner_service.all_in_api_slack will be updated in-place
  ~ resource "aws_apprunner_service" "all_in_api_slack" {
        id                             = "arn:aws:apprunner:ap-northeast-1:451153100141:service/all_in_slack/a1d29e5b95024ae9bd54357249909875"
        tags                           = {
            "Name" = "slack-all-in-apprunner-service"
        }
        # (7 unchanged attributes hidden)

      ~ instance_configuration {
          ~ cpu               = "512" -> "0.25 vCPU"
          ~ memory            = "1024" -> "0.5 GB"
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_ecr_repository.all_in_api will be updated in-place
  ~ resource "aws_ecr_repository" "all_in_api" {
        id                   = "all_in_api"
      ~ image_tag_mutability = "MUTABLE" -> "IMMUTABLE"
        name                 = "all_in_api"
        tags                 = {}
        # (4 unchanged attributes hidden)

      ~ image_scanning_configuration {
          ~ scan_on_push = false -> true
        }

        # (1 unchanged block hidden)
    }

  # aws_ecr_repository.all_in_api_discord will be updated in-place
  ~ resource "aws_ecr_repository" "all_in_api_discord" {
        id                   = "all_in_api_discord"
      ~ image_tag_mutability = "MUTABLE" -> "IMMUTABLE"
        name                 = "all_in_api_discord"
        tags                 = {}
        # (4 unchanged attributes hidden)

      ~ image_scanning_configuration {
          ~ scan_on_push = false -> true
        }

        # (1 unchanged block hidden)
    }

  # aws_ecr_repository.all_in_api_slack will be updated in-place
  ~ resource "aws_ecr_repository" "all_in_api_slack" {
        id                   = "all_in_api_slack"
      ~ image_tag_mutability = "MUTABLE" -> "IMMUTABLE"
        name                 = "all_in_api_slack"
        tags                 = {}
        # (4 unchanged attributes hidden)

      ~ image_scanning_configuration {
          ~ scan_on_push = false -> true
        }

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.access will be updated in-place
  ~ resource "aws_iam_policy" "access" {
        id               = "arn:aws:iam::451153100141:policy/apprunner-access-ecr"
        name             = "apprunner-access-ecr"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:DescribeImages",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ap-northeast-1:451153100141:repository/all_in_api"
                      - Sid      = "ReadPrivateEcr"
                    },
                  - {
                      - Action   = [
                          - "ssm:DescribeParameters",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeImages",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AuthPrivateEcr"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.discord_access will be updated in-place
  ~ resource "aws_iam_policy" "discord_access" {
        id               = "arn:aws:iam::451153100141:policy/apprunner-access-ecr-discord"
        name             = "apprunner-access-ecr-discord"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:DescribeImages",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ap-northeast-1:451153100141:repository/all_in_api_discord"
                      - Sid      = "ReadPrivateEcr"
                    },
                  - {
                      - Action   = [
                          - "ssm:DescribeParameters",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeImages",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AuthPrivateEcr"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.slack_access will be updated in-place
  ~ resource "aws_iam_policy" "slack_access" {
        id               = "arn:aws:iam::451153100141:policy/apprunner-access-ecr-slack"
        name             = "apprunner-access-ecr-slack"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:DescribeImages",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ap-northeast-1:451153100141:repository/all_in_api_slack"
                      - Sid      = "ReadPrivateEcr"
                    },
                  - {
                      - Action   = [
                          - "ssm:DescribeParameters",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeImages",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AuthPrivateEcr"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":223,"Program":"tfcmt","SHA1":"8d3f82421e30b9bc5c9072ba2afe766d2b4c9a22","Target":"terraform/env","Vars":{},"WorkflowName":"pull_request_target"} -->